import mochaOvercoat from './assets/mocha-overcoat.jpg';
import dreamGown from './assets/dream-gown.jpg';
import rainJacket from './assets/rain-jacket.jpg';
import merlotSuit from './assets/merlot-suit.jpg';
import moonlightDress from './assets/moonlight-dress.jpg';
import denimPioneer from './assets/denim-pioneer.jpg';

export const DUMMY_PRODUCTS = [
  {
    id: 'p1',
    image: mochaOvercoat,
    title: 'เสื้อคลุมวินเทจม็อคค่า',
    price: 129.99,
    description:
      'ถ่ายทอดความหรูหราเหนือกาลเวลาด้วยเสื้อคลุมมอคค่าที่น่าทึ่งนี้ สร้างขึ้นสำหรับสุภาพบุรุษผู้มีวิสัยทัศน์ที่ชื่นชอบการผสมผสานระหว่างเสน่ห์แบบวินเทจและความสง่างามสมัยใหม่',
  },
  {
    id: 'p2',
    image: dreamGown,
    title: 'ชุดความฝันบลัชออนที่มีเสน่ห์',
    price: 189.99,
    description:
      'ดื่มด่ำไปกับแสงแห่งความสง่างามด้วย ความฝันบลัชออนที่มีเสน่ห์ ของเรา รวบรวมความสง่างามของราชินีด้วยสัมผัสอันแสนหวานของสีชมพูที่กระซิบความน่าหลงใหล นี่คือผลงานที่สมบูรณ์แบบสำหรับผู้ที่ต้องการสร้างช่วงเวลาอันน่าจดจำ',
  },

  {
    id: 'p3',
    image: rainJacket,
    title: 'เสื้อแจ็คเก็ตกันฝนซันไชน์วินเทจ',
    price: 49.99,
    description:
      'จัดฉากอาบน้ำอย่างมีสไตล์! เสื้อแจ็คเก็ต Vintage Sunshine Rain ของเราช่วยให้คุณโดดเด่นแม้ในสภาพอากาศที่เลวร้ายที่สุด เพราะฝนไม่ใช่เหตุผลที่จะประนีประนอมกับความฉลาดทางแฟชั่นของคุณ',
  },
  {
    id: 'p4',
    image: merlotSuit,
    title: 'ชุดสูทชั้นเยี่ยมทำจากหนังคางคก',
    price: 249.99,
    description:
    'ก้าวเข้าสู่ห้องประชุมด้วยความมั่นใจที่ไม่มีใครเทียบได้ใน ชุดสูทชั้นเยี่ยมทำจากหนังคางคก ของเรา มีกลิ่นอายของความมีระดับที่ประณีตและพลังที่เกินบรรยาย เหมาะอย่างยิ่งสำหรับผู้บริหารสมัยใหม่ที่ให้ความสำคัญกับขนบธรรมเนียมประเพณีและความสง่างาม',
    },
    {
    id: 'p5',
    image: moonlightDress,
    title: 'ชุดราตรีแสงจันทร์ไร้ตัวตน',
    price: 159.99,
    description:
    'กวาดห้องให้สวยด้วยชุดราตรีแสงจันทร์อันไร้ตัวตนของเรา ชุดเดรสนี้สร้างขึ้นเพื่อเลียนแบบเสน่ห์ของแสงจันทร์ เพื่อยกย่องผู้ที่ชื่นชอบความเย้ายวนใจอันละเอียดอ่อนและรูปทรงที่โดดเด่น',
    },
    {
    id: 'p6',
    image: denimPioneer,
    title: 'เสื้อแจ็คเก็ตหนังกระทิงทนทาน',
    price: 79.99,
    description:
    'เสื้อแจ็คเก็ตหนังกระทิงทนทาน ของเราสร้างขึ้นเพื่อยกย่องผู้ที่รวบรวมจิตวิญญาณแห่งการผจญภัย เสื้อแจ็คเก็ตตัวนี้ได้รับการออกแบบโดยคำนึงถึงความทนทานและความสบาย จึงเป็นตู้เสื้อผ้าที่จำเป็นสำหรับนักสำรวจในเมือง'
    }
];
